#ifndef ABC_RANDOM_H
#define ABC_RANDOM_H

#include <cstdlib>

//------------------------------------------------------------------------------
// random.h - содержит генератор случайных чисел в диапазоне от 1 до 20
//------------------------------------------------------------------------------

// Целое в диапазоне от 1 до 20.
inline auto Random() {
    return rand() % 20 + 1;
}
// Случайное вещественное число.
inline auto RandomDouble() {
    return (rand() % (1000)) / 1000.0 + 1;
}
#endif //ABC_RANDOM_H